/** @file

;******************************************************************************
;* Copyright (c) 2015, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/
 
/=#

#include "Standard.uni"

//
// Kernel
//
#include "AtaStrings.uni"
#include "BootOptionStrings.uni"
#include "ExitItemsStrings.uni"
#include "HddPwStrings.uni"
#include "PpmStrings.uni"
//[-start-160413-IB04190071-add]//
#include "UsbStrings.uni"
//[-end-160413-IB04190071-add]//
//
//  Chipset
//
#include "SwitchableGraphicsStrings.uni"
//[-start-160923-IB07400789-modify]//
#include "SegChipsetFeatureStrings.uni"
//[-end-160923-IB07400789-modify]//
//
//  RC
//
#include "VfrStrings.uni"

#string STR_EFI_SETUP_UTILITY_TITLE                        #language en-US        "InsydeH2O Setup Utility"
                                                           #language fr-FR        "Logiciel de Configuration d'InsydeH2O"
                                                           #language zh-TW        "\wide系微\narrow H2O \wide設定工具\narrow"
                                                           #language ja-JP        "InsydeH2O \wideセットアップユーティリティ\narrow"
                                                           #language it-IT        "Configuratore InsydeH2O"
                                                           #language es-ES        "Utilitario de la programación de InsydeH2O"
                                                           #language de-DE        "InsydeH2O-Anbringung"
                                                           #language pt-PT        "Configura Utilidade do InsydeH2O"
#string STR_BLANK_STRING                                   #language en-US        " "
                                                           #language fr-FR        " "
                                                           #language zh-TW        " "
                                                           #language ja-JP        " "
                                                           #language it-IT        " "
                                                           #language es-ES        " "
                                                           #language de-DE        " "
                                                           #language pt-PT        " "
#string STR_YES_TEXT                                       #language en-US        "Yes"
                                                           #language fr-FR        "Oui"
                                                           #language zh-TW        "\wide是\narrow"
                                                           #language ja-JP        "\wideはい\narrow"
                                                           #language it-IT        "Si"
                                                           #language es-ES        "Sí"
                                                           #language de-DE        "Ja"
                                                           #language pt-PT        "Sim"
#string STR_NO_TEXT                                        #language en-US        "No"
                                                           #language fr-FR        "Non"
                                                           #language zh-TW        "\wide否\narrow"
                                                           #language ja-JP        "\wideいいえ\narrow"
                                                           #language it-IT        "No"
                                                           #language es-ES        "Sí"
                                                           #language de-DE        "Nein"
                                                           #language pt-PT        "Não"
#string STR_DISABLED_TEXT                                  #language en-US        "Disabled"
                                                           #language fr-FR        "Désactiver"
                                                           #language zh-TW        "\wide停用\narrow"
                                                           #language ja-JP        "\wide使用しない\narrow"
                                                           #language it-IT        "Disabilitato"
                                                           #language es-ES        "inhabilitado"
                                                           #language de-DE        "Sperren"
                                                           #language pt-PT        "Proibir"
#string STR_ENABLED_TEXT                                   #language en-US        "Enabled"
                                                           #language fr-FR        "Activer"
                                                           #language zh-TW        "\wide啟用\narrow"
                                                           #language ja-JP        "\wide使用する\narrow"
                                                           #language it-IT        "abilitato"
                                                           #language es-ES        "permitido"
                                                           #language de-DE        "Aktivieren"
                                                           #language pt-PT        "Permitir"
#string STR_AUTO_TEXT                                      #language en-US        "Auto"
                                                           #language fr-FR        "Automatique"
                                                           #language zh-TW        "\wide自動\narrow"
                                                           #language ja-JP        "\wide保存する\narrow"
                                                           #language it-IT        "Auto"
                                                           #language es-ES        "Auto"
                                                           #language de-DE        "Automatisch"
                                                           #language pt-PT        "Auto"
#string STR_ON                                             #language en-US        "ON"
#string STR_OFF                                            #language en-US        "OFF"
#string STR_NOT_INSTALLED_TEXT                             #language en-US        "Not Installed"
                                                           #language fr-FR        "Pas Installé"
                                                           #language zh-TW        "\wide未安裝\narrow"
                                                           #language ja-JP        "\wideなし\narrow"
                                                           #language it-IT        "Non Installato"
                                                           #language es-ES        "No Instalado"
                                                           #language de-DE        "Nicht Installiert"
                                                           #language pt-PT        "Não Instalado"
#string STR_ON_TEXT                                        #language en-US        "On"
                                                           #language fr-FR        "On"
                                                           #language zh-TW        "\wide開\narrow"
                                                           #language ja-JP        "\wideオン\narrow"
                                                           #language it-IT        "Acceso"
                                                           #language es-ES        "On"
                                                           #language de-DE        "Ein"
                                                           #language pt-PT        "Não"
#string STR_OFF_TEXT                                       #language en-US        "Off"
                                                           #language fr-FR        "Off"
                                                           #language zh-TW        "\wide關\narrow"
                                                           #language ja-JP        "\wideオフ\narrow"
                                                           #language it-IT        "Spento"
                                                           #language es-ES        "Off"
                                                           #language de-DE        "Aus"
                                                           #language pt-PT        "Desligar"
#string STR_OK_TEXT                                        #language en-US        "Ok"
                                                           #language fr-FR        "Ok"
                                                           #language zh-TW        "\wide確定\narrow"
                                                           #language it-IT        "OK"
                                                           #language es-ES        "OK"
                                                           #language de-DE        "OKAY"
                                                           #language pt-PT        "OK"
#string STR_CANCEL_TEXT                                    #language en-US        "Cancel"
                                                           #language fr-FR        "Supprimer"
                                                           #language zh-TW        "\wide取消\narrow"
                                                           #language ja-JP        "\wideキャンセル\narrow"
                                                           #language it-IT        "Cancella"
                                                           #language es-ES        "Cancelar"
                                                           #language de-DE        "Abbrechen"
                                                           #language pt-PT        "Cancelar"
#string STR_NOT_USED_TEXT                                  #language en-US        "Not Used"
                                                           #language fr-FR        "Pas Usé"
                                                           #language zh-TW        "\wide未使用\narrow"
                                                           #language ja-JP        "\wide未使用\narrow"
                                                           #language it-IT        "Non usato"
                                                           #language es-ES        "No utilizado"
                                                           #language de-DE        "Nicht verwendet"
                                                           #language pt-PT        "Não usado"
#string STR_NONE_TEXT                                      #language en-US        "None"
                                                           #language fr-FR        "Aucune"
                                                           #language zh-TW        "\wide無\narrow"
                                                           #language ja-JP        "\wide未使用\narrow"
                                                           #language it-IT        "Nessuno"
                                                           #language es-ES        "Ningún"
                                                           #language de-DE        "Keine"
                                                           #language pt-PT        "Nada"
#string STR_DEFAULT_TEXT                                   #language en-US        "Default"
                                                           #language fr-FR        "Par Defaut"
                                                           #language zh-TW        "\wide原始值\narrow"
                                                           #language ja-JP        "\wide標準設定\narrow"
                                                           #language it-IT        "Default"
                                                           #language es-ES        "Defecto"
                                                           #language de-DE        "Standardeinstellung"
                                                           #language pt-PT        "Default"
#string STR_ENABLE_TEXT                                    #language en-US        "Enable"
                                                           #language fr-FR        "Activé"
                                                           #language zh-TW        "\wide開啟\narrow"
                                                           #language ja-JP        "\wide有効化する\narrow"
                                                           #language it-IT        "Abilitare"
                                                           #language es-ES        "Permitir"
                                                           #language de-DE        "Aktivieren"
                                                           #language pt-PT        "Permitir"
#string STR_DISABLE_TEXT                                   #language en-US        "Disable"
                                                           #language fr-FR        "Désactivé"
                                                           #language zh-TW        "\wide取消\narrow"
                                                           #language ja-JP        "\wide無効化する\narrow"
                                                           #language it-IT        "Disabilitare"
                                                           #language es-ES        "Inhabilitar"
                                                           #language de-DE        "Sperren"
                                                           #language pt-PT        "Proibir"														   
#string STR_SETTING_ITEM_STRING                            #language en-US        "Setting items on this screen to incorrect values"
                                                           #language fr-FR        "En cours de régler ces items sur l'écran en valeurs incorrectes"
                                                           #language zh-TW        "\wide項目設定錯誤\narrow"
                                                           #language ja-JP        "\wideこの画面の項目を間違った値に設定すると\narrow"
                                                           #language it-IT        "Voci d`impostazione sullo schermo sono incorrette"
                                                           #language es-ES        "Artículos ajustados en esta pantalla a los valores incorrectos"
                                                           #language de-DE        "Einstellungsfelder auf diesem Bildschirm zu den falschen Werten"
                                                           #language pt-PT        "Os itens de ajuste neste ecrã para os valores incorretos"
#string STR_MALFUNCTION_STRING                             #language en-US        "may cause your system to malfunction!"
                                                           #language fr-FR        "Va vauser votre système malfonctionner!"
                                                           #language zh-TW        "\wide可能造成您的系統無法正常運作\narrow!"
                                                           #language ja-JP        "\wideこのシステムが誤作動を起こすことがあります\narrow"
                                                           #language it-IT        "Il vostro sistema potrebbe funzionare in modo incorretto!"
                                                           #language es-ES        "Pueda causar su sistema a malfuncionamiento!"
                                                           #language de-DE        "können Ihr System zur Störung verursachen!"
                                                           #language pt-PT        "Pode causar malfunção para o seu sistema!"
#string STR_GOTO_MAIN                                      #language en-US        "Goto Main Menu"
                                                           #language fr-FR        "Aller au Menu Principal"
                                                           #language zh-TW        "\wide至\narrow \wide主選單\narrow"
                                                           #language it-IT        "Vai a Menu Principale"
                                                           #language es-ES        "Va a Menú Principal"
                                                           #language de-DE        "Hauptmenü hingehen"
                                                           #language pt-PT        "Ir ao Menu Principal"
#string STR_GOTO_ADVANCED                                  #language en-US        "Goto Advanced Menu"
                                                           #language fr-FR        "Aller au Menu Advancé"
                                                           #language zh-TW        "\wide至\narrow \wide進階選單\narrow"
                                                           #language it-IT        "Vai a Menu Avanzato"
                                                           #language es-ES        "Va a Menú Avanzado"
                                                           #language de-DE        "Fortgeschritten menü hingehen"
                                                           #language pt-PT        "Ir ao Menu Avançado"
#string STR_GOTO_SECURITY                                  #language en-US        "Goto Security Menu"
                                                           #language fr-FR        "Aller au Menu Securité"
                                                           #language zh-TW        "\wide至\narrow \wide安全選單\narrow"
                                                           #language it-IT        "Vai a Menu Sicurezza"
                                                           #language es-ES        "Va a Menú Seguridad"
                                                           #language de-DE        "Sicherheit menü hingehen"
                                                           #language pt-PT        "Ir ao Menu Segurança"
#string STR_GOTO_POWER                                     #language en-US        "Goto Power Menu"
                                                           #language fr-FR        "Aller au Menu Puissance"
                                                           #language zh-TW        "\wide至\narrow \wide能源選單\narrow"
                                                           #language it-IT        "Vai a Menu Alimentazione"
                                                           #language es-ES        "Va a Menú Energía"
                                                           #language de-DE        "Energieversorgung menü hingehen"
                                                           #language pt-PT        "Ir ao Menu Potência"
#string STR_GOTO_BOOT                                      #language en-US        "Goto Boot Menu"
                                                           #language fr-FR        "Aller au Menu Amorçage"
                                                           #language zh-TW        "\wide至\narrow \wide開機選單\narrow"
                                                           #language it-IT        "Vai a Menu Accensione"
                                                           #language es-ES        "Va a Menú Menú de Boot"
                                                           #language de-DE        "Aufladung menü hingehen"
                                                           #language pt-PT        "Ir ao Menu Boot"
#string STR_GOTO_EXIT                                      #language en-US        "Goto Exit Menu"
                                                           #language fr-FR        "Aller au Menu Quitter"
                                                           #language zh-TW        "\wide至\narrow \wide離開選單\narrow"
                                                           #language it-IT        "Vai a Menu Uscire"
                                                           #language es-ES        "Va a Menú Salir"
                                                           #language de-DE        "Beenden menü hingehen"
                                                           #language pt-PT        "Ir ao Menu Sair"
#string STR_PREVIOUS_PAGE_TEXT                             #language en-US        "Goto Previous Page"
                                                           #language fr-FR        "Aller au Page Précédente"
                                                           #language zh-TW        "\wide至\narrow \wide上頁\narrow"
                                                           #language ja-JP        "\wide至\narrow \wide前ページ\narrow"
                                                           #language it-IT        "Vai a Pagina precedente"
                                                           #language es-ES        "Va a Página Anterior"
                                                           #language de-DE        "Vorhergehende Seite hingehen"
                                                           #language pt-PT        "Ir ao Página Anterior"
#string STR_CHECK_PASSWORD_STRING                          #language en-US        "Enter Current Password:"
                                                           #language fr-FR        "Entrer Mot de Passe Present:"
                                                           #language zh-TW        "\wide輸入密碼\narrow:"
                                                           #language ja-JP        "\wide現在のパスワードを入力してください\narrow:"
                                                           #language it-IT        "Digitare password attuale:"
                                                           #language es-ES        "Ingrese Contraseña Actual:"
                                                           #language de-DE        "Aktuelles Kennwort eintragen:"
                                                           #language pt-PT        "Entre Senha Corrente:"
//
//  Form 1: Main
//
#string STR_TIME_HELP                                      #language en-US        "This is the help for the hour, minute, second field. Valid range is from 0 to 23, 0 to 59, 0 to 59. INCREASE/REDUCE : +/-."
                                                           #language fr-FR        "C'est utile pour regler l'heure, l'minute, l'Seconde. Champsvalide est de 0 à 23, 0 à 59, 0 à 59. AUGEMENTER/REDUIRE : +/-."
                                                           #language zh-TW        "\wide時\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 23.\wide分\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 59.\wide秒\narrow \wide的有效值範圍從\narrow 0 \wide至\narrow 59."
                                                           #language ja-JP        "\wide現在の時刻を、時\narrow:\wide分\narrow:\wide秒で設定します。\narrow(\wide時\narrow:0~23) \narrow(\wide分\narrow:0~59) \narrow(\wide秒\narrow:0~59)      <Pg Up>\wideまたは\narrow<SPACE>\wideキーで設定します。\narrow                                <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
                                                           #language it-IT        "Assistenza per campo ora, minuti, Secondi. Raggio valido da 0 a 23, 0 a 59, 0 a 59. AUMENTO/RIDUZIONE : +/-."
                                                           #language es-ES        "Ésta es la ayuda para el campo de la hora, minuto, Segundo. La gama válida es a partir de 0 a 23, 0 a 59, 0 a 59. INCREASE/REDUCE: +/-."
                                                           #language de-DE        "Das ist die Hilfe für das Stundenfeld, Minutefeld, Sekundefeld. Gültiger Bereich ist von 0 bis 23, 0 bis 59, 0 bis 59. ZUNAHME/ABNAHME: +/-."
                                                           #language pt-PT        "Esta é uma ajuda para hora, Minuto, Segundo. A escala válida é de 0 a 23, 0 a 59, 0 a 59. AUMENTAR/REDUZIR: +/-"
#string STR_DATE_PROMPT                                    #language en-US        "System Date"
                                                           #language fr-FR        "Date Système"
                                                           #language zh-TW        "\wide系統日期\narrow"
                                                           #language ja-JP        "\wideシステム日付\narrow"
                                                           #language it-IT        "Data del sistema"
                                                           #language es-ES        "Fecha de Sistema"
                                                           #language de-DE        "Systemdatum"
                                                           #language pt-PT        "Data de Sistema"
#string STR_DATE_HELP                                      #language en-US        "This is the help for the month field, day field, year field. Valid range is from 1 to 12, 1 to 31, 2000 to 2099. (Error checking will be done against month/day/year combinations that are not supported.) INCREASE/REDUCE : +/-."
                                                           #language fr-FR        "C'est utile pour regler l'mois, l'jour, l'an. Champsvalide est de 1 à 12, 1 à 31, 2000 à 2099. (Verification incorrecte sera contre les combinaison de mois/jour/an qui sont pas supportées.) AUGEMENTER/REDUIRE : +/-."
                                                           #language zh-TW        "\wide月\narrow \wide的有效值範圍從\narrow 1 \wide至\narrow 12. \wide日\narrow \wide的有效值範圍從\narrow 1 \wide至\narrow 31. \wide年\narrow \wide的有效值範圍從\narrow 2000 \wide至\narrow 2099. (\wide若輸入不符\narrow month/day/year\wide組合\narrow, \wide將會自動偵錯\narrow.)"
                                                           #language ja-JP        "\wide現在の日付を、\wide月\narrow/\wide日\narrow/\wide年で設定します。\narrow(\wide月\narrow:1~12) \narrow(\wide日\narrow:1~31) (\wide年\narrow:2000~2099)                         <Pg Up>\wideまたは\narrow<SPACE>\wideキーで設定します。\narrow                                  <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
                                                           #language it-IT        "Assistenza per campo mese, giorno, anno. Raggio valido da 1 a 12, 1 a 31, 2000 a 2099. AUMENTO/RIDUZIONE : +/-."
                                                           #language es-ES        "Ésta es la ayuda para el campo de la mes, día, año. La gama válida es a partir de 1 a 12, 1 a 31, 2000 a 2099. INCREASE/REDUCE: +/-."
                                                           #language de-DE        "Das ist die Hilfe für das Monatfeld, Tagfeld, Jahrfeld. Gültiger Bereich ist von 1 bis 12, 1 bis 31, 2000 bis 2099. ZUNAHME/ABNAHME: +/-."
                                                           #language pt-PT        "Esta é uma ajuda para Mês, Dia, Ano. A escala válida é de 1 a 12, 1 a 31, 2000 a 2099. AUMENTAR/REDUZIR: +/-"
#string STR_DATE_DAY_HELP                                  #language en-US        "This is the help for the day field. Valid range is from 1 to 31. (Error checking will be done against month/day/year combinations that are not supported. INCREASE/REDUCE : +/-."
                                                           #language fr-FR        "C'est utile pour regler l'jour. Champsvalide est de 1 à 31. (Verification incorrecte sera contre les combinaison de mois/jour/an qui sont pas supportées.) AUGEMENTER/REDUIRE : +/-."
                                                           #language zh-TW        "\wide日\narrow \wide的有效值範圍從\narrow 1 \wide至\narrow 31. (\wide若輸入不符\narrow month/day/year\wide組合\narrow, \wide將會自動偵錯\narrow.)"
                                                           #language ja-JP        "\wide現在の日付を、\wide月\narrow/\wide日\narrow/\wide年で設定します。\narrow(\wide日\narrow:1~31)                          <Pg Up>\wideまたは\narrow<SPACE>\wideキーで設定します。\narrow                                  <Pg Dn> \wideキーで設定\narrow      \wideします。\narrow                                       <Tab> \wideキーで右の項目に移動します。\narrow"
                                                           #language it-IT        "Assistenza per campo giorno. Raggio valido da 1 a 31. AUMENTO/RIDUZIONE : +/-."
                                                           #language es-ES        "Ésta es la ayuda para el campo de la día. La gama válida es a partir de 1 a 31. INCREASE/REDUCE: +/-."
                                                           #language de-DE        "Das ist die Hilfe für das Tagfeld. Gültiger Bereich ist von 1 bis 31. ZUNAHME/ABNAHME: +/-."
                                                           #language pt-PT        "Esta é uma ajuda para Dia. A escala válida é de 1 a 31. AUMENTAR/REDUZIR: +/-"

#string STR_ADVANCED_TITLE                                 #language en-US        "Advanced"
                                                           #language fr-FR        "Advancé"
                                                           #language zh-TW        "\wide進階\narrow"
                                                           #language ja-JP        "\wide詳細\narrow"
                                                           #language it-IT        "Avanzato"
                                                           #language es-ES        "Avanzado"
                                                           #language de-DE        "Fortgeschritten"
                                                           #language pt-PT        "Avançado"
#string STR_CHIPSET_CONFIG_STRING                          #language en-US        "Chipset Configuration"
                                                           #language fr-FR        "Configuration de Chipset"
                                                           #language zh-TW        "\wide晶片組設定\narrow"
                                                           #language it-IT        "Configurazione Chipset"
                                                           #language es-ES        "Configuración Chipset"
                                                           #language de-DE        "Chipset Konfiguration"
                                                           #language pt-PT        "Configuração de Chipset"
#string STR_CHIPSET_CONFIG_HELP                            #language en-US        "Advanced Chipset Configuration Options."
                                                           #language fr-FR        "Options de Configuration de Chipset Advancé"
                                                           #language zh-TW        "\wide進階晶片組設定選擇\narrow."
                                                           #language ja-JP        "\wide高度なチップセットの設定項目\narrow."
                                                           #language it-IT        "Opzioni di configurazione avanzate chip"
                                                           #language es-ES        "Opciones de configuración de Chipset avanzado."
                                                           #language de-DE        "Fortgeschrittene Chipset-Konfigurations-Optionen."
                                                           #language pt-PT        "Opções de Configuração de Chipset Avançadas"
														   
//
// Form 0x2C : System component 
//
#string STR_MISC_OPTION_FORM_TITLE                         #language en-US  "Miscellaneous Configuration"
#string STR_MISC_OPTION_FORM_HELP                          #language en-US  "Enable/Disable Misc. Features"
#string STR_CLOCK_SPREAD_SPEC_ENABLE                       #language en-US "Clock Spread Spectrum"
#string STR_CLOCK_SPREAD_SPEC_ENABLE_HELP                  #language en-US "Enable Clock Chip's Spread Spectrum feature"
#string STR_SYSTEM_COMPONENT_TITLE                         #language en-US "System Component"
#string STR_SYSTEM_COMPONENT_HELP                          #language en-US ""
#string STR_PMIC_CONFIGURATION_TITLE                       #language en-US "PMIC Congfiguration"
#string STR_PMIC_ACPI_OBJECT_PROMPT                        #language en-US "PMIC ACPI OBJECT"
#string STR_PMIC_ACPI_OBJECT_HELP                          #language en-US "Enable/Disable PMIC ACPI Device."
#string STR_NON_ULPMC                                      #language en-US "Non ULPMC solution"
#string STR_ULPMC                                          #language en-US "ULPMC solution"
#string STR_PSS_ENABLE_PROMPT                              #language en-US "PSS Storage"
#string STR_PSS_ENABLE_HELP                                #language en-US "Disable/Enable PSS-based secure boot"
#string STR_PSS_CONFIGURATION_TITLE                        #language en-US "PSS Settings"

#string STR_SPCR_SUPPORT_STRING                            #language en-US  "ACPI SPCR Table"
#string STR_SPCR_SUPPORT_HELP                              #language en-US  "Serial Port Console Redirection Table : Enabled this feature, the SPCR table will be add-into ACPI Tables."
#string STR_SYSTEM_BUS_SPEED_STRING                        #language en-US        "System Bus Speed"
                                                           #language fr-FR        "Vitesse de Systèm Bus"
                                                           #language zh-TW        "\wide系統匯流排速度\narrow"
                                                           #language ja-JP        "\wideシステムバスの速度\narrow"
                                                           #language it-IT        "Velocita` Bus sistema"
                                                           #language es-ES        "Velocidad de Bus de Sistema"
                                                           #language de-DE        "System-Bus Geschwindigkeit"
                                                           #language pt-PT        "Velocidade de Circuito de Sistema"
#string STR_SYSTEM_BUS_SPEED_STRING2                       #language en-US        "[Not Detected]"
                                                           #language fr-FR        "[Pas Detecte]"
                                                           #language zh-TW        "[\wide未偵測到\narrow]"
                                                           #language ja-JP        "[\wide非検出\narrow]"
                                                           #language it-IT        "[Non identificato]"
                                                           #language es-ES        "[No Detectado]"
                                                           #language de-DE        "[Nicht entdeckt]"
                                                           #language pt-PT        "[Nao detectado]"
                                                           
#string STR_PLAT_CONF_TITLE                            #language en-US  "Platform Specific Configurations "
#string STR_CAMERA_SELECT_PROMPT                       #language en-US "Camera Selection"
#string STR_CAMERA_SELECT_HELP                         #language en-US "Select either USB3 Camera or MIPI Camera"
#string STR_USB3_CAM                                   #language en-US "USB3_CAMERA"
#string STR_MIPI_CAM                                   #language en-US "MIPI_CAMERA"                                                           

//
// BSW Virtual Button Support
//
#string STR_VPBE_PROMPT                               #language en-US  "Virtual Button Support"
#string STR_VPBE_HELP                                 #language en-US  "Enable / Disable Virtual Power Button support: Only 4 Sec Power Button, Windows Home, Vol Up/Down, Rotation UnLock, and UnDock. Does not support 10 sec Power Button, Dock Mode."
#string STR_VPBE_ENABLE                               #language en-US  "Enable"
#string STR_VPBE_DISABLE                              #language en-US  "Disable"

#string STR_VPBE_ROTATION_LOCK_PROMPT                 #language en-US  "Rotation Lock state"
#string STR_VPBE_ROTATION_LOCK_PROMPT_HELP            #language en-US  "Rotation Lock state, 0 - Unlock, 1 - Lock"
#string STR_VPBE_ROTATION_LOCK                        #language en-US  "Lock"
#string STR_VPBE_ROTATION_UNLOCK                      #language en-US  "Unlock"

#string STR_VPBE_CONVERTIBLE_MODE_PROMPT              #language en-US  "  Convertible state"
#string STR_VPBE_CONVERTIBLE_MODE_PROMPT_HELP         #language en-US  "Convertible state, 0 - Slate, 1 - Notebook/Calmshell"
#string STR_VPBE_SLATE_MODE                           #language en-US  "Slate"
#string STR_VPBE_CALMSHELL_MODE                       #language en-US  "CalmShell"

#string STR_VPBE_DOCK_STATE_PROMPT                    #language en-US  "  Dock state"
#string STR_VPBE_DOCK_STATE_PROMPT_HELP               #language en-US  "Dock Indicator, 0 - Undock, 1 - Dock"
#string STR_VPBE_DOCK_STATE                           #language en-US  "Dock"
#string STR_VPBE_UNDOCK_STATE                         #language en-US  "UnDock"

//
// EM-1 Selection Option
//
#string STR_EM1_IAAPPSRUN_PROMPT                       #language en-US "IA_APPS_RUN"
#string STR_EM1_IAAPPSRUN_HELP                         #language en-US "Voltage in mV"
#string STR_EM1_IAAPPSCAP_PROMPT                       #language en-US "IA_APPS_CAP"
#string STR_EM1_IAAPPSCAP_HELP                         #language en-US "Percentage"
#string STR_EM1_CAP_OR_VOLTAGE_PROMPT                  #language en-US "USE IA_APPS_RUN or CAP"
#string STR_EM1_CAP_OR_VOLTAGE_HELP                    #language en-US "Use Voltage or Capacity to decide boot flow"

#string STR_OEM1_CAP_FREQ_IDX_PROMPT                   #language en-US "CAP_Freq_Index"
#string STR_OEM1_CAP_FREQ_IDX_HELP                     #language en-US "Index into CPU Frequency Table"

//
//  For Andorid Modem
// 
#string STR_ACPI_MODEM_SEL_PROMPT                      #language en-US "Modem Selection"
#string STR_ACPI_MODEM_SEL_HELP                        #language en-US "Modem Selection"
#string STR_MODEM_7360                                 #language en-US "7360_ES1XX_SSIC"
#string STR_MODEM_7260_ES201                           #language en-US "7262_ES2XX_HSIC"
#string STR_MODEM_7260_ES2001                          #language en-US "7262_ES2XX_SSIC"

#string STR_ACPI_TABLE_STRING                          #language en-US        "ACPI Table/Features Control"
                                                       #language fr-FR        "ACPI Table/ Caractère de Contrôle"
                                                       #language zh-TW        "ACPI \wide表\narrow/\wide特性\narrow \wide控制\narrow"
                                                       #language ja-JP        "ACPI \wideテーブル\narrow/\wide機能の操作\narrow"
                                                       #language it-IT        "Controllo Tavola/Caratteristiche ACPI"
                                                       #language es-ES        "Control de tabla/características de ACPI"
                                                       #language de-DE        "ACPI Tabellen/Merkmals-Steuerung"
                                                       #language pt-PT        "ACPI Interface/Controle de Características"
#string STR_ACPI_TABLE_HELP                            #language en-US        "Configures ACPI Tables/Features setting."
                                                       #language fr-FR        "   "
                                                       #language zh-TW        "   "
                                                       #language it-IT        "   "
                                                       #language es-ES        "   "
                                                       #language de-DE        "   "
                                                       #language pt-PT        "   "
#string STR_DISABLE_ACPI_SX_STRING                     #language en-US        "Disable ACPI _Sx:"
                                                       #language fr-FR        "Désactivere ACPI _Sx:"
                                                       #language zh-TW        "\wide停用\narrow ACPI _Sx:"
                                                       #language it-IT        "Disabilitare ACPI _Sx:"
                                                       #language es-ES        "Inhabilite ACPI _Sx:"
                                                       #language de-DE        "Sperren ACPI _Sx:"
                                                       #language pt-PT        "Proibir ACPI _Sx:"
//Lakemore
//
#string STR_LM_INFORMATION_TITLE                       #language en-US "Lakemore Configuration:"
#string STR_LM_MEMORY_HELP                             #language en-US "Specify the amount of main memory to be reserved for Lakemore.  The memory will be allocated right after MRC initialization and its location will be stored into the Lakemore STOREMEMBAR registers."
#string STR_LM_MEMORY_PROMPT                           #language en-US "Memory Allocation Size"
#string STR_LM_MEMORY_16MB                             #language en-US "16000 KiB"
#string STR_LM_MEMORY_8MB                              #language en-US "8000 KiB"
#string STR_LM_MEMORY_1MB                              #language en-US "1000 KiB"
#string STR_LM_MEMORY_128KB                            #language en-US "128 KiB"
#string STR_LM_MEMORY_0MB                              #language en-US "0 KiB"

#string STR_PUINT_BIOS_CONFIG_DISPLAY                  #language en-US "PDM/Dfx Setting"
#string STR_PUINT_BIOS_CONFIG_DISPLAY_HELP             #language en-US "PDM On: Enable PDM and keep Dfx powered.\n\nPerf Mode: Disable PDM and keep Dfx powered. Allows more VISA signals to be used for HW debug.\n\nPower Save: Disable PDM, turn off Dfx power and Visa clocks.\n\nNOTE: If previous setting was POWERSAVE, then cold boot will be needed for Dfx to come back up."
#string STR_PUINT_BIOS_PDM                             #language en-US "PDM On"
#string STR_PUINT_BIOS_PERFORMANCE                     #language en-US "Perf Mode"
#string STR_PUINT_BIOS_POWERSAVE                       #language en-US "Power Save"
#string STR_PUINT_BIOS_RESERVED                        #language en-US "Debug Reserved"

#string STR_ENABLE_DBG2                                #language en-US "Enable DBG2 Table"
#string STR_ENABLE_DBG2_HELP                           #language en-US "Enable/Disable DBG2 ACPI Table for Windbg"

#string STR_PMWEIGHTS_PROMPT                           #language en-US "PM Weights"
#string STR_PMWEIGHTS_HELP                             #language en-US "Enabled/Disabled PM Weights"

#string STR_F22REWORK_PROMPT                           #language en-US "F22 Rework"
#string STR_F22REWORK_HELP                             #language en-US "Enabled/Disabled F22 Rework"

#string STR_PDM_OUTPUT_CONFIG_SWTICH                  #language en-US "PDM Msg Output"
#string STR_PDM_OUTPUT_CONFIG_SWTICH_HELP             #language en-US "Configure VISA and Lakemore for PDM with the given output.\n\nIf MainMem is selected then be sure to allocate memory for the output msgs in the above setting."
#string STR_PDM_OUTPUT_MEM                            #language en-US "Main Memory"
#string STR_PDM_OUTPUT_IO                             #language en-US "IO - TBD"
                                        
//
// Form 0x2E: ISCT Configuration
//
#string STR_ISCT_FORM_TITLE                            #language en-US  "ISCT Configuration"
#string STR_ISCT_FORM_HELP                             #language en-US  "ISCT / AOAC Configuration Settings"

#string STR_ISCT_CONFIGURATION                         #language en-US  "ISCT Configuration"
#string STR_ISCT_CONFIGURATION_HELP                    #language en-US  "Enable/Disable ISCT Feature"

#string STR_ISCT_NOTIFICATION_CONTROL_PROMPT           #language en-US  "ISCT Notification Control"
#string STR_ISCT_NOTIFICATION_CONTROL_HELP             #language en-US  "Enable/Disable ISCT Notification Control"
#string STR_ISCT_WLAN_CONTROL_PROMPT                   #language en-US  "ISCT WLAN Power Control"
#string STR_ISCT_WLAN_CONTROL_HELP                     #language en-US  "Enable/Disable ISCT WLAN Power Control"
#string STR_ISCT_WWAN_CONTROL_PROMPT                   #language en-US  "ISCT WWAN Power Control"
#string STR_ISCT_WWAN_CONTROL_HELP                     #language en-US  "Enable/Disable ISCT WWAN Power Control"

#string STR_ISCT_SLEEP_DURATION_FORMAT                 #language en-US  "ISCT Sleep Duration Value Format"
#string STR_ISCT_SLEEP_DURATION_FORMAT_HELP            #language en-US  "ISCT Sleep Duration is only in Seconds Format, Actual time format is not supported"

#string STR_ISCT_RF_KILL_SUPPORT                       #language en-US  "ISCT RF Kill Support"
#string STR_ISCT_RF_KILL_SUPPORT_HELP                  #language en-US  "ISCT RF Kill (Radio On/Off) is based on Soft switch, No physical switch available"

#string STR_SECONDS                                    #language en-US  "Seconds"
#string STR_ACTUAL_TIME                                #language en-US  "Actual Time"

#string STR_RF_KILL_SOFT                               #language en-US  "Soft Switch"
#string STR_RF_KILL_PHYSICAL                           #language en-US  "Physical Switch"
#string STR_WLAN_PRESENCE_FORM_TITLE                   #language en-US  "WLAN Card Presence"
#string STR_WLAN_NGFF_CARD	                           #language en-US  "NGFF Card Inserted"
#string STR_WLAN_NGFF_HELP	                           #language en-US  "Set 'YES' If NGFF Card is Inserted"
#string STR_WLAN_UHPAM_CARD                            #language en-US  "UHPAM Card Inserted"
#string STR_WLAN_UHPAM_HELP                            #language en-US  "Set 'YES' If UHPAM Card is Inserted"

#string STR_EXISUPPORT_PROMPT	                         #language en-US "ExI"
#string STR_EXISUPPORT_HELP		                         #language en-US "Enabled/Disabled ExI"
#string STR_DATP_PROMPT_STRING                         #language en-US "Active Trip Points"
#string STR_DATP_HELP                                  #language en-US "Disable Active Trip Points"

#string STR_WINDOWS_STRING                             #language en-US "Windows"
#string STR_ANDROID_STRING                             #language en-US "Android"
#string STR_WINDOWS_7_STRING                           #language en-US "Windows 7"
//[-start-161007-IB07400794-add]//
#string STR_LINUX_STRING                               #language en-US "Linux"
//[-end-161007-IB07400794-add]//
#string STR_ANDROID_OPTIONS_TITLE                      #language en-US "Android"
#string STR_ANDROID_OPTIONS_HELP                       #language en-US ""
#string STR_PCIE_BCM4356_SUBTITLE                      #language en-US  "PCIe based WLAN module - BCM4356"
#string STR_PCIE_BCM4356_PROMPT                        #language en-US  "BCM4356"
#string STR_PCIE_BCM4356_HELP                          #language en-US  "By enabling this option, the corresponding GPIO configuration is performed to support this add-in card on CherryTrail - RVP."
#string STR_SVID_PROMPT                               #language en-US "PUNIT SVID"
#string STR_SVID_HELP                                 #language en-US "Enable or disable SVID configuration"
#string STR_FLASHLESS_MODEM_SETTING_PROMPT              #language en-US  "Flashless Modem"
#string STR_FLASHLESS_MODEM_SETTING_HELP                #language en-US  "Enable/Disable Flashless Modem"
#string STR_MS_LAT_SDBUS_DRIVER_PROMPT               #language en-US "MS Custom Sdbus Driver"
#string STR_MS_LAT_SDBUS_DRIVER_HELP                 #language en-US "Enable/Disable MS Custom Sdbus Driver"
#string STR_PLT_CLK_SELECT                             #language en-US "Platform Clk Selection"
#string STR_PLT_CLK_SELECT_HELP                        #language en-US "Option to Disable PLT_CL 0-4 ,LPE,ISH for AOS"
#string STR_XDB_GPIO_PROMPT                           #language en-US "XDB GPIO"
#string STR_XDB_GPIO_PROMPT_HELP                              #language en-US "XDB GPIO"
#string STR_CAMERA_DEVICE_SETTING_SUBTITLE             #language en-US  "Camera Devices Configuration"
#string STR_CAMERA_SELECTION_PROMPT                    #language en-US  "RVP Camera Selection"
#string STR_CAMERA_SELECTION_HELP                      #language en-US  "Select Camera Device"
#string STR_CYNTHIANA_A                                #language en-US  "Cynthiana_A"
#string STR_CYNTHIANA_2B                               #language en-US  "Cynthiana_2B"
#string STR_CRD_B_V2_X                                 #language en-US  "CRD_B v2.x"
#string STR_CYNTHIANA_2B_CR                            #language en-US  "Cynthiana_2B_CR"
#string STR_COMBO_AIC_PROMPT                           #language en-US  "COMBO AIC"
#string STR_COMBO_AIC_HELP                             #language en-US  "Enable/Disable COMBO AIC"

//[-start-160704-IB07220103-modify]//
#string STR_SOC_STRING                                 #language en-US "BXT SOC"
//[-start-160704-IB07220103-modify]//
#string STR_SOC_VALUE                                  #language en-US "N/A"
#string STR_MRC_VERSION_STRING                         #language en-US "MRC Version"
#string STR_MRC_VERSION_VALUE                          #language en-US "N/A"
#string STR_PUNIT_FW_STRING                            #language en-US "PUNIT FW"
#string STR_PUNIT_FW_VALUE                             #language en-US "N/A"
#string STR_KSC_FW_STRING                              #language en-US "KSC FW"
#string STR_KSC_FW_VALUE                               #language en-US "N/A"
//[-start-160418-IB07400718-modify]//
#string STR_PMC_FW_STRING                              #language en-US "PMC FW"
//[-end-160418-IB07400718-modify]//
#string STR_PMC_FW_VALUE                               #language en-US "N/A"
#string STR_ULPMC_FW_STRING                            #language en-US "ULPMC FW"
#string STR_ULPMC_FW_VALUE                             #language en-US "N/A"
#string STR_SEC_FW_STRING                              #language en-US "SEC FW"
#string STR_SEC_FW_VALUE                               #language en-US "N/A"
#string STR_GOP_STRING                                 #language en-US "GOP"
#string STR_GOP_VALUE                                  #language en-US "N/A"
#string STR_CHIP_IGD_VBIOS_REV_HELP                    #language en-US "IGD VBIOS Version"
#string STR_CHIP_IGD_VBIOS_REV_NAME                    #language en-US "IGD VBIOS Version"
#string STR_CHIP_IGD_VBIOS_REV_VALUE                   #language en-US "N/A"
#string STR_CPU_FLAVOR_HELP                            #language en-US "CPU Flavor"
#string STR_CPU_FLAVOR_NAME                            #language en-US "CPU Flavor"
#string STR_CPU_FLAVOR_VALUE                           #language en-US "N/A"
#string STR_PROCESSOR_MICROCODE_REV_NAME               #language en-US "Microcode Revision"
#string STR_PROCESSOR_MICROCODE_VALUE                  #language en-US "Not loaded"
#string STR_BOARD_INFORMATION_STRING                   #language en-US "Board Information"
#string STR_BOARD_ID_HELP                              #language en-US "Displays the Board ID."
#string STR_BOARD_ID_NAME                              #language en-US "Board ID"
#string STR_BOARD_ID_VALUE                             #language en-US "N/A"
#string STR_FAB_ID_HELP                                #language en-US "Displays the Fab ID"
#string STR_FAB_ID_STRING                              #language en-US "Fab ID"
#string STR_FAB_ID_VALUE                               #language en-US "N/A"
#string STR_TXE_FW_STRING                              #language en-US "TXE FW"
#string STR_TXE_FW_VALUE                               #language en-US "N/A"
#string STR_PLATFORM_FIRMWARE_STRING                   #language en-US "Platform firmware Information"
#string STR_MFGMODE                                    #language en-US "Manufacture Mode"
#string STR_MFGMODE_HELP                               #language en-US "Manufacture Mode Status"
//[-start-160704-IB07220103-add]//
#string STR_ISH_FW_STRING                              #language en-US "ISH FW"
#string STR_ISH_FW_VALUE                               #language en-US "N/A"
//[-start-160704-IB07220103-add]//


#string STR_CONFIG_DATA_ID_STRING                      #language en-US        "Config ID"
#string STR_CONFIG_DATA_ID_STRING2                     #language en-US        "[Not Detected]"

#string STR_TOGGLE_SCD_PROMPT                         #language en-US "Toggle SelfClockDisabling"
#string STR_TOGGLE_SCD_HELP                           #language en-US "Enable/Disable Toggling of SelfClockDisabling feature at RunTime"
#string STR_GPS_HID_TITLE                              #language en-US "AOS GPS HID Selection"
#string STR_GPS_HID_TITLE_HELP                         #language en-US "Select the GPS HID for AOS. Default is BCM47521"
#string STR_HID_BCM47521_TITLE                         #language en-US "Broadcom 47521 GPS"
#string STR_HID_INT33A2_TITLE                         #language en-US "Intel CG2000 GPS"
//[-start-161215-IB08450359-remove]//
//#string STR_H2OUVE_SUPPORT_STRING                      #language en-US        "H2OUVE Support"
//                                                       #language zh-TW        "H2OUVE Support"
//#string STR_H2OUVE_SUPPORT_HELP                        #language en-US        "Enable/Disable interface for H2OUVE tool."
//                                                       #language zh-TW        "Enable/Disable interface for H2OUVE tool."
//[-end-161215-IB08450359-remove]//
#string STR_PUNIT_POWER_CONFIGURATION_PROMPT           #language en-US "PUNIT Power Configuration"
#string STR_PUNIT_POWER_CONFIGURATION_HELP             #language en-US "Enable or disable Punit Power Configuration"
#string STR_SVID_CONFIGURATION_PROMPT                  #language en-US "Svid Configuration"
#string STR_SVID_CONFIGURATION_HELP                    #language en-US "Choose the Right SVID Config. Platform default is to set SVID according CRB Board ID which is read from EC."
#string STR_PLATFORM_DEFAULTS_TEXT                     #language en-US "Platform Defaults"
#string STR_SVID_CONFIG_0_TEXT                         #language en-US "Svid Config 0"
#string STR_SVID_CONFIG_1_TEXT                         #language en-US "Svid Config 1"
#string STR_SVID_CONFIG_3_TEXT                         #language en-US "Svid Config 3"

#string STR_LOW_POWER_S0_IDLE                          #language en-US "Low Power S0 Idle Capability" 
#string STR_LOW_POWER_S0_IDLE_HELP                     #language en-US "This variable determines if we enable ACPI Lower Power S0 Idle Capability (Mutually exclusive with Smart connect)" 

#string STR_TARGET_TPM_PROMPT                          #language en-US "Target TPM device"
//[-start-170322-IB07400848-add]//
#string STR_TARGET_TPM_HELP                            #language en-US "Select Target TPM device"
//[-end-170322-IB07400848-add]//
#string STR_TARGET_TPM_FTPM                            #language en-US "fTPM"
#string STR_TARGET_TPM_DTPM                            #language en-US "dTPM"

#string STR_CRASHDUMP_PROMPT                           #language en-US "Offline Crash Dump selection"
#string STR_CRASHDUMP_HELP                             #language en-US "Offline Crash Dump support"

#string STR_BOM_SELETION_PROMPT                        #language en-US "BOM Switch"
#string STR_BOM_SELETION_HELP                          #language en-US "BOM Switch"

#string STR_TO_BE_LOADED                               #language en-US "Will Load After Reboot" 

#string STR_BXT_B0                                     #language en-US "BXT B0 Selected"
#string STR_BXT_A0                                     #language en-US "BXT A0 Selected"

#string STR_FEATURE_SELETION_PROMPT                    #language en-US "Feature Switch"
#string STR_FEATURE_SELETION_HELP                      #language en-US "Feature Switch"

#string STR_BXT_AOS_FEATURE                            #language en-US "AOS Feature Selected"
#string STR_BXT_WOS_FEATURE                            #language en-US "WOS Feature Selected"

#string STR_IO_APIC_MODE_STRING                            #language en-US        "APIC - IO APIC Mode"
                                                           #language fr-FR        "APIC - IO APIC Mode"
                                                           #language zh-TW        "APIC - IO APIC \wide模式\narrow"
                                                           #language it-IT        "APIC - IO APIC Modalita`"
                                                           #language es-ES        "APIC - IO APIC Modo"
                                                           #language de-DE        "APIC - IO APIC Modus"
                                                           #language pt-PT        "APIC - IO APIC Modo"
#string STR_IO_APIC_MODE_HELP                              #language en-US        "This item is valid only for WIN2k and WINXP.Also,a fresh install of the OS must occur when APIC Mode is desired.Test the IO ACPI by setting item to Enable.The APIC Table will then be pointed to by the RSDT,the Local APIC will be initialized,and the proper enable bits will be set in ICH4M"
                                                           #language fr-FR        "Cet item est valide juste pour WIN2k et WINXP. Aussi, une installation initialle OS doit se produire quand APIC Mode est desiré. Tester IO ACPI par determiner l'item sur Activé. APIC Table sera alors pointé par RSDT, Local APIC sera initialisé, et proper bits activés seront determinés dans ICH4M"
                                                           #language zh-TW        "\wide這個項目僅在\narrowwin2k\wide和\narrowwinxp\wide下有效\narrow"
                                                           #language it-IT        "Questa voce e` valida solamente per WIN2k e WINXP. Inoltre, una nuova installazione di OS deve essere effettuata quando la Modalita` APIC e` richiesta. Controllare IO ACPI tramite i valori d`impostazione per Abilitare. La scheda APIC verra` puntata tramite RSDT, l`APIC locale verra` inizializzato, i bit corretti verranno impostati su ICH4M"
                                                           #language es-ES        "Este artículo es válido solamente para WIN2k y WINXP. También, una instalación fresca del OS debe ocurrirse cuando el Modo de APIC es deseado. Pruebe el IO ACPI por ajustando el artículo para Permitirlo. La tabla de APIC entonces será señalada por el RSDT, el APIC Local será inicializado, y los bits apropiados permitibles serán ajustados en ICH4M"
                                                           #language de-DE        "Dieses Feld ist nur gültig für WIN2k und WINXP. Auch eine frische Installation vom Betriebssystem muss auftreten, wenn APIC Modus erwünscht wird. Prüfen Sie den IO ACPI, indem Sie Feld einstellen, um zu aktivieren. Die APIC Tabelle wird dann durch das RSDT gespitzt; das lokale APIC wird initialisiert, und die korrekten aktivierte Bits werden in ICH4M eingestellt"
                                                           #language pt-PT        "O item é válido apenas para WIN2k e WINXP. Também, uma fresca instalação de OS deve ocorrer quando o APIC Modo é desejada. Teste o IO ACPI por ajustar o item para Aprovar.O APIC Interface será apontado por RSDT, o Local APIC será initializado, e os bits apropriados serão ajustados em ICH4M."

//[-start-160720-IB03090429-add]//
#string STR_CLEAR_CSE_DATA_REGION_QUESTION                 #language en-US        "System will restart and clear NVM / RPMB data region, Do you want to continue..."
//[-end-160720-IB03090429-add]/
//[-start-171225-IB07400000-add]//
#string STR_EC_ASL_CODE_SUPPORT                            #language en-US "EC ASL code Support"
#string STR_EC_ASL_CODE_SUPPORT_HELP                       #language en-US "Enable/Disable EC ASL code support"
//[-end-171225-IB07400000-add]//